In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from scipy import stats
from math import *
import plotly.graph_objs as go
import plotly.express as px
import seaborn as sns

In [5]:
df = pd.read_csv('height_cleaned.csv')

In [6]:
df.head(10)

,Unnamed: 0,Rank,Country Name,Average height in Cm,Male Height in Cm,Female Height in Cm,Average height in Ft,Male Height in Ft,Female Height in Ft
0,0,1,Netherlands,177.07,183.78,170.36,5.81,6.03,5.59
1,1,2,Montenegro,176.63,183.30,169.96,5.80,6.01,5.58
2,2,3,Estonia,175.72,182.79,168.66,5.76,6.00,5.53
3,5,6,Denmark,175.68,181.89,169.47,5.76,5.97,5.56
4,4,5,Iceland,175.50,182.10,168.91,5.76,5.97,5.54
5,7,8,Latvia,174.99,181.17,168.81,5.74,5.94,5.54
6,3,4,Bosnia and Herzegovina,174.97,182.47,167.47,5.74,5.99,5.49
7,6,7,Czech Republic,174.58,181.19,167.96,5.72,5.94,5.51
8,12,13,Serbia,174.52,180.74,168.29,5.72,5.93,5.52
9,13,14,Lithuania,174.18,180.72,167.63,5.72,5.93,5.50

In [7]:
df.describe()

,Unnamed: 0,Rank,Average height in Cm,Male Height in Cm,Female Height in Cm,Average height in Ft,Male Height in Ft,Female Height in Ft
count,199.000000,199.000000,199.000000,199.000000,199.000000,199.000000,199.000000,199.000000
mean,99.000000,100.000000,167.015879,173.089045,160.942915,5.479598,5.678794,5.280402
std,57.590508,57.590508,4.432758,4.949832,4.076377,0.145772,0.162510,0.133870
min,0.000000,1.000000,156.420000,160.130000,150.910000,5.130000,5.250000,4.950000
25%,49.500000,50.500000,163.895000,169.490000,158.240000,5.375000,5.560000,5.190000
50%,99.000000,100.000000,167.000000,173.530000,160.620000,5.480000,5.690000,5.270000
75%,148.500000,149.500000,170.350000,176.510000,163.870000,5.590000,5.790000,5.375000
max,198.000000,199.000000,177.070000,183.780000,170.360000,5.810000,6.030000,5.590000